{"_id":{"$oid":"618909605ac4c4e827948d0e"},"Title":"The Pirates of Silicon Valley","Description":"This is a must watch movie for everyone who wants to know how personal computers came into the world. The biographical drama tells how Steve Jobs and Bill Gates came up with the idea of creating a computer that could be used by everyone and shows the methodologies they used. It also explores the impact that the rivalry between Jobs and Gates had on the development of the personal computer.","Genre":{"Name":"Biopic","Description":"A biopic tells the life story of a historical person or at least the most historically important years of their lives."},"Director":{"Name":"Martyn Burke","Bio":"Martyn Burke is a Canadian director, novelist and screenwriter.","Birth":"1952"},"ImagePath":"https://upload.wikimedia.org/wikipedia/en/3/30/Movieposterposv.jpg","Featured":true}
{"_id":{"$oid":"61890b195ac4c4e827948d0f"},"Title":"The Imitation Game","Description":"The Imitation Game should be on your watchlist if you are interested in machine learning and the history of computer science. This historical drama shows how the British mathematician Alan Turing and his team find a way to decode the German Enigma Code and help the Allies to win the war against Germany.","Genre":{"Name":"Drama","Description":"A Drama is focused on emotions and defined by conflict, often looking to reality rather than sensationalism."},"Director":{"Name":"Morten Tyldum","Bio":"Morten Tyldum is a Norwegian film director. He is also known for directing the science fiction drama Passengers and the thriller Headhunters which is based on a novel by Jo Nesbø.","Birth":"1967"},"ImagePath":"https://upload.wikimedia.org/wikipedia/en/8/87/The_Imitation_Game_%282014%29.png","Featured":true}
{"_id":{"$oid":"61890c3d5ac4c4e827948d10"},"Title":"The Internship","Description":"If you think you are too old to start a career in tech, this comedy is for you. It’s about to guys who lose their jobs and apply for Google’s internship program. Even though they know nothing about programming, they somehow get chosen and find themselves at Google headquarter in Mountain View, surrounded by young tech geniuses half their age.","Genre":{"Name":"Comedy","Description":"Comedy is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect."},"Director":{"Name":"Shawn Levy","Bio":"Shawn Levy is a Canadian film director, producer, and actor. He has also directed the Night at the Museum series and some episodes of the Netflix series Stranger Things.","Birth":"1968"},"ImagePath":"https://upload.wikimedia.org/wikipedia/en/e/ed/The-internship-poster.jpg","Featured":false}
{"_id":{"$oid":"61890d8b5ac4c4e827948d11"},"Title":"The Social Network","Description":"The Social Network is about the early stages of Facebook, how it grew as a business, and about the intellectual property lawsuits Mark Zuckerberg faced from his co-founders. There are lots of references to coding, algorithms and the ups and downs of tech startups.","Genre":{"Name":"Biopic","Description":"A biopic tells the life story of a historical person or at least the most historically important years of their lives."},"Director":{"Name":"David Fincher","Bio":"David Fincher is an American film director. For The Social Network he won the Golden Globe Award. Big commercial successes were The Curious Case of Benjamin Button and Gone Girl. For the Netflix series House of Cards David Fincher served as an executive producer and director. Fincher also directed TV commercials for clients like Nike, Coca-Cola and Chanel and music videos for Madonna, The Rolling Stones, Michael Jackson, Aerosmith and many others.","Birth":"1962"},"ImagePath":"https://upload.wikimedia.org/wikipedia/en/8/8c/The_Social_Network_film_poster.png","Featured":true}
{"_id":{"$oid":"61890fc75ac4c4e827948d12"},"Title":"Tron","Description":"Tron is a cult movie for programmers. Jeff Bridges plays the programmer and video game developer  Kevin Flynn who gets sucked into the virtual world of computers. He uses some amazing coding skills to find his way back int the normal world. This movie is very retro and at the same time shows some amazing special effects considering it was launched in 1982.  There is a sequel titled Tron: Legacy that was released in 2010 and follows Flynn’’s adult son Sam.","Genre":{"Name":"Science Fiction","Description":"Science-fiction films are defined by a combination of imaginative speculation and a scientific or technological premise, making use of the changes and trajectory of technology and science."},"Director":{"Name":"Steven Lisberger","Bio":"Steven Lisberger is an American film director, producer. The inspiration for Tron dates back to the 70s, when Lisberger became intrigued with video games after seeing Pong.","Birth":"1951"},"ImagePath":"https://upload.wikimedia.org/wikipedia/en/1/17/Tron_poster.jpg","Featured":true}
{"_id":{"$oid":"6189109a5ac4c4e827948d13"},"Title":"Hackers","Description":"This crime story is starring Angelina Jolie in her first leading role in a major film. It follows a group of high school students who use their programming skills for corporate extortion. The movie was released back in 1995 when the Internet was unfamiliar to the general public. Hence the movie went over the heads of people,  but it achieved cult classic status. It has some nice retro moments like when computer geeks get totally excited about 28.8Kbps Macs.","Genre":{"Name":"Crime","Description":"Crime movies focus on criminal acts and especially on the investigation, either by an amateur or a professional detective, of a serious crime, generally a murder."},"Director":{"Name":"Iain Softley","Bio":"Iain Softley is an English film director, producer, and screenwriter. His other films include Backbeat about the early years of The Beatles.","Birth":"1956"},"ImagePath":"https://upload.wikimedia.org/wikipedia/en/6/67/Hackersposter.jpg","Featured":false}
{"_id":{"$oid":"618911b75ac4c4e827948d14"},"Title":"Antitrust","Description":"Antitrust is a thriller about the dirty side of the software industry. A young programmer got a job at a large software company which is considered programmer's heaven with significant salaries and an informal working environment. But soon he starts to unravel the terrible truth behind the company's great success.","Genre":{"Name":"Thriller","Description":"Thriller film, also known as suspense film or suspense thriller, is a broad film genre that involves excitement and suspense in the audience."},"Director":{"Name":"Peter Howitt","Bio":"Peter Howitt is a British actor and film director. His debut as a director was the movie Sliding doors with Gwyneth Paltrow.","Birth":"1957"},"ImagePath":"https://upload.wikimedia.org/wikipedia/en/2/2a/Antitrust_poster.jpg","Featured":false}
{"_id":{"$oid":"6189128f5ac4c4e827948d15"},"Title":"Jobs","Description":"This movie is based on the life of Steve Jobs from being a college dropout to founding Apple out of a garage. It revolves around how Apple became the business enterprise that it is today. This movie not only shows the technical skills of Jobs but also his vision of changing the world. Recommended not only for Apple enthusiasts.","Genre":{"Name":"Biopic","Description":"A biopic tells the life story of a historical person or at least the most historically important years of their lives."},"Director":{"Name":"Joshua Michael Stern","Bio":"Joshua Michael Stern is an American film director and screenwriter. He also created the political comedy television series Graves starring Nick Nolte."},"ImagePath":"https://upload.wikimedia.org/wikipedia/en/e/e0/Jobs_%28film%29.jpg","Featured":false}
{"_id":{"$oid":"6189136c5ac4c4e827948d16"},"Title":"Ex Machina","Description":"Ex Machina follows a young programmer who is invited to test an android named Ava. He quickly finds himself fascinated with her — but things take a turn. The movie revolves around how artificial intelligence can be used to make the world a better place. But it also warns us against the harmful effects of not using it correctly.","Genre":{"Name":"Science Fiction","Description":"Science-fiction films are defined by a combination of imaginative speculation and a scientific or technological premise, making use of the changes and trajectory of technology and science."},"Director":{"Name":"Alex Garland","Bio":"Alex Garland is an English writer and filmmaker. In the 90s he rose to prominence as a novelist with his novel The Beach, which was later adapted into a film directed by Danny Boyle and starring Leonardo DiCaprio. The science fiction thriller Ex Machina was Garlands directorial debut.","Birth":"1970"},"ImagePath":"https://up  ImagePamedia.org/wikipedia/en/b/ba/Ex-machina-uk-poster.jpg","Featured":false}
{"_id":{"$oid":"618914f75ac4c4e827948d17"},"Title":"Her","Description":"Heartbroken writer Theodore purchases a virtual assistent with AI that is designed to adapt and evolve like a human being. He decides that it should have a female voice, and she names herself Samantha. They bond over their discussions about love and life. This science-fiction romantic drama received numerous awards and nominations","Genre":{"Name":"Romance","Description":"Primarily focuses on the relationship and romantic love between two people."},"Director":{"Name":"Spike Jonze","Bio":"Adam Spiegel, known professionally as Spike Jonze, is an American filmmaker, photographer, musician, and actor. His work includes film, skateboard videos, television, music videos, and commercials.","Birth":"1969"},"ImagePath":"https://upload.wikimedia.org/wikipedia/en/4/44/Her2013Poster.jpg","Featured":false}
{"_id":{"$oid":"618916565ac4c4e827948d18"},"Title":"The Girl with the Dragon Tattoo","Description":"This thriller is based on a novel by Swedish writer Stieg Larsson. Rooney Mara plays a tatted up hacker who is anti-social but very efficient. She assists a journalist in his investigation to find out what happened to a girl that disappeared 40 years ago.","Genre":{"Name":"Thriller","Description":"Thriller film, also known as suspense film or suspense thriller, is a broad film genre that involves excitement and suspense in the audience."},"Director":{"Name":"David Fincher","Bio":"David Fincher is an American film director. For The Social Network he won the Golden Globe Award. Big commercial successes were The Curious Case of Benjamin Button and Gone Girl. For the Netflix series House of Cards David Fincher served as an executive producer and director. Fincher also directed TV commercials for clients like Nike, Coca-Cola and Chanel and music videos for Madonna, The Rolling Stones, Michael Jackson, Aerosmith and many others.","Birth":"1962"},"ImagePath":"https://upload.wikimedia.org/wikipedia/en/8/80/The_Girl_with_the_Dragon_Tattoo_Poster.jpg","Featured":false}
